Catalogs/ВидыВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыВычетовИПН</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредоставлениеВычета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПредоставленияВычетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзносов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговВзносовОтчислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПределВычета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодыРасчетаВычетовИКорректировокДоходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыПредоставленияВычетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыПредоставленияВычетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоИсчисленнойСуммеВзносов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандартный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПериодическимПлатежам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыВычетовИПН/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПредоставлениеВычета <> Перечисления.ВидыПредоставленияВычетов.ПоИсчисленнойСуммеВзносов Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ВидВзносов");
	КонецЕсли;
	Если ПредоставлениеВычета <> Перечисления.ВидыПредоставленияВычетов.Стандартный Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "ПределВычета");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления Тогда
		Если Предопределенный Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Предопределенные элементы данного справочника нельзя пометить на удаление.'"),,,,Отказ);
			Возврат;
		КонецЕсли;
		ОбновитьПриоритеты(Приоритет,Отказ);
	ИначеЕсли Приоритет = 0 Тогда
		Приоритет = Справочники.ВидыВычетовИПН.МаксимальныйПриоритет() + 1;
	Иначе
		ПроверитьУникальностьПриоритета(Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Приоритет = 0;
	ПределВычета = 0;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУникальностьПриоритета(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.Приоритет = &Приоритет
		|	И ВидыВычетовИПН.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Приоритет", Приоритет);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТекстОшибки = НСтр("ru = 'В справочнике уже существует элемент с указанным приоритетом.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , , Отказ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьПриоритеты(Знач ПриоритетОбъекта,Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВычетовИПН.Ссылка
		|ИЗ
		|	Справочник.ВидыВычетовИПН КАК ВидыВычетовИПН
		|ГДЕ
		|	ВидыВычетовИПН.Приоритет > &Приоритет
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидыВычетовИПН.Приоритет";
	
	Запрос.УстановитьПараметр("Приоритет", ПриоритетОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НачатьТранзакцию();
	
	Попытка
		
		Приоритет = 0;
		ЭтотОбъект.ОбменДанными.Загрузка = Истина;
		ЭтотОбъект.Записать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			// Блокируем объект от изменения другими сеансами.
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.ВидыВычетовИПН");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", ВыборкаДетальныеЗаписи.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Приоритет = ПриоритетОбъекта;
			СправочникОбъект.ОбменДанными.Загрузка = Истина;
			СправочникОбъект.Записать();
			ПриоритетОбъекта = ПриоритетОбъекта + 1;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обновление приоритетов справочников'"),
			УровеньЖурналаРегистрации.Ошибка,ЭтотОбъект.Метаданные(),
			Ссылка,ИнформацияОбОшибке());
		ТекстОшибки = НСтр("ru = 'При обновлении приоритетов справочника возникла ошибка, см. ""Журнал регистрации"".'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , , ,Отказ);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
